diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорыИРеализации</name>
    <attributes>
      <name>Договоры</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	Период = Объект.Период;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите период");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = СоздатьДокументыНаСервере(); 
	
	Оповещение = Новый ОписаниеОповещения("СоздатьДокументыЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьДокументыНаСервере()
	
	НачалоПериода = НачалоМесяца(Объект.Период);
	КонецПериода = КонецМесяца(Объект.Период);
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
		"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыНаСервере", НачалоПериода, КонецПериода);

КонецФункции  

&НаКлиенте
Процедура СоздатьДокументыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат.Статус = "Выполнено" Тогда
		МассивДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ЗаполнитьТабличнуюЧасть(МассивДокументов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧасть(МассивДокументов)

	Объект.ДоговорыИРеализации.Очистить();

	Для Каждого Документ Из МассивДокументов Цикл
		НоваяСтрока = Объект.ДоговорыИРеализации.Добавить();
		НоваяСтрока.Договоры = Документ.Договор;
		НоваяСтрока.РеализацияТоваровУслуг = Документ.Реализация;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
